[
  {
    "image": "https://www.manufacturednc.com/assets/img/companies/Alphatech-Inc/logo.png",
    "title": "App Alpha",
    "companyName": "AlphaTech Inc.",
    "id": 1,
    "description": "This productivity app is designed to help individuals and teams efficiently manage tasks, schedules, and daily routines in one organized space. It provides a clean and intuitive interface where users can create to-do lists, set reminders, and prioritize important deadlines. With integrated scheduling features, users can plan their day, week, or month with ease and stay on top of personal and professional commitments. The app also supports collaboration, allowing team members to share tasks, assign responsibilities, and track progress in real time, making it ideal for workplace productivity as well as personal planning. Notifications and alerts ensure that important deadlines are never missed, while analytics provide insights into time usage and task completion trends. Whether you are a student balancing assignments, a professional juggling meetings, or someone looking to stay more organized, this app adapts to your workflow and helps you stay productive every day.",

    "size": 24.5,
    "reviews": 1200,
    "ratingAvg": 4.6,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 625 }
    ]
  },
  {
    "image": "https://media.licdn.com/dms/image/v2/C560BAQHF4u6bI4GopQ/company-logo_200_200/company-logo_200_200/0/1630643422866?e=2147483647&v=beta&t=1shn0kgv4Qu6woBv4PB8BwydYBykLUf776-8CiRDI4k",
    "title": "Budget Buddy",
    "companyName": "FinanceSoft Ltd.",
    "id": 2,
    "description": "This personal budgeting and expense tracking tool is designed to make money management simple, clear, and stress-free. It allows users to create monthly or weekly budgets, categorize expenses, and keep track of spending in real time. With an easy-to-use dashboard, you can quickly see where your money is going, how much is left in your budget, and which areas need better control. The app supports adding multiple accounts, linking bank transactions, and generating insightful reports to analyze financial habits. Users can set savings goals, receive reminders for upcoming bills, and get alerts when approaching spending limits. By visualizing income and expenses with charts and summaries, it becomes easier to stay accountable and plan ahead. Whether you are saving for a big purchase, paying off debt, or simply trying to live within your means, this tool helps build smarter money habits and improves overall financial health over time.",
    "size": 18.7,
    "reviews": 820,
    "ratingAvg": 4.3,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://images.crunchbase.com/image/upload/c_pad,f_auto,q_auto:eco,dpr_1/ti77elotipp9iumbauau",
    "title": "ChatNow",
    "companyName": "CommuniTech",
    "id": 3,
    "description": "This instant messaging app provides a fast and reliable way to stay connected with friends, family, and colleagues. It supports one-on-one and group chats, making conversations simple and organized. Users can enjoy high-quality voice and video calls with minimal lag, ensuring smooth communication even across long distances. The app also includes features like media sharing, emojis, stickers, and file attachments for a more engaging experience. With end-to-end encryption, conversations remain private and secure. Lightweight and easy to use, this app is ideal for both personal and professional communication, helping people connect instantly anytime and anywhere.",
    "size": 32.0,
    "reviews": 2500,
    "ratingAvg": 4.8,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1685 }
    ]
  },
  {
    "image": "https://yt3.googleusercontent.com/ytc/AIdro_lm2gkaRdbhXn-dxyAx8Wbo_Q2T2t680Fz5o7aSV6Zplw=s900-c-k-c0x00ffffff-no-rj",
    "title": "DesignPro",
    "companyName": "Creative Labs",
    "id": 4,
    "description": "This graphic design tool is built for both professionals and hobbyists who want to create visually stunning content with ease. It offers a wide range of features, including customizable templates, drag-and-drop editing, vector tools, and advanced color controls, making it suitable for everything from simple social media graphics to complex design projects. Users can experiment with typography, illustrations, and effects while keeping projects organized in one workspace. The tool supports multiple formats and exports, ensuring compatibility across platforms. Whether you are a beginner learning design basics or a professional working on client projects, this tool adapts to your creative needs.",
    "size": 45.6,
    "reviews": 900,
    "ratingAvg": 4.4,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 110 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 390 }
    ]
  },
  {
    "image": "https://pd.daffodilvarsity.edu.bd/web/image/website/1/social_default_image?unique=52182d0",
    "title": "EduLearn",
    "companyName": "SmartEdu",
    "id": 5,
    "description": "This e-learning platform is designed to make education more engaging, flexible, and accessible for learners of all backgrounds. It offers a wide variety of courses covering subjects such as technology, business, science, arts, and personal development, allowing students to learn at their own pace. Each course is structured into easy-to-follow modules that combine video lectures, reading materials, and interactive content for a complete learning experience. To reinforce knowledge, the platform provides quizzes, assignments, and practice tests that help learners evaluate their progress and strengthen their understanding of key concepts. Learners can track their performance with detailed analytics and receive instant feedback to identify areas for improvement. The platform also includes discussion boards and community features where students can connect with peers, share insights, and ask questions, creating a collaborative learning environment. In addition, many courses are created by industry professionals and certified instructors, ensuring high-quality and up-to-date content. Upon completion, learners can earn certificates that showcase their skills and boost career opportunities. With mobile and web access, users can study anytime and anywhere, making it easy to fit education into a busy lifestyle. Whether you are preparing for exams, advancing your career, or learning a new skill for personal growth, this e-learning platform provides the tools and resources you need to succeed.",
    "size": 27.3,
    "reviews": 1500,
    "ratingAvg": 4.7,
    "downloads": 800000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 875 }
    ]
  },
  {
    "image": "https://seeklogo.com/images/H/health-wave-logo-E8CC6CAF56-seeklogo.com.png",
    "title": "FitTrack",
    "companyName": "HealthWave",
    "id": 6,
    "description": "This fitness tracking and health analytics app is designed to help users take control of their physical well-being and develop healthier habits. It allows you to monitor daily activities such as steps, distance, calories burned, and workout sessions, while also providing advanced insights into overall performance trends. With customizable fitness goals, reminders, and progress tracking, the app keeps users motivated to stay active and consistent. In addition to activity tracking, it includes features for monitoring heart rate, sleep patterns, hydration, and nutrition, giving a complete overview of personal health. Detailed analytics and visual reports highlight strengths, areas of improvement, and progress toward goals, empowering users to make informed lifestyle choices. The app also integrates with wearables and smart devices, syncing data seamlessly for accurate results. Whether you are a beginner starting a fitness journey or an athlete optimizing performance, this tool adapts to individual needs and offers guidance every step of the way. By combining fitness tracking with health analytics, it becomes an all-in-one companion for building long-term wellness and improving overall quality of life.",
    "size": 22.8,
    "reviews": 1350,
    "ratingAvg": 4.5,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 630 }
    ]
  },
  {
    "image": "https://playverse.gr/wp-content/uploads/2023/03/logo-playverse-yellow-rgb-1-e1678966130549.png",
    "title": "GameHub",
    "companyName": "Playverse",
    "id": 7,
    "description": "This mobile gaming hub offers a diverse collection of mini-games in one convenient platform, providing endless entertainment for players of all ages. Instead of downloading multiple apps, users can access puzzle games, strategy challenges, racing adventures, and casual arcade fun directly from one hub. Each game is designed to be lightweight, quick to play, and engaging, making it perfect for short breaks or long play sessions. The platform includes leaderboards, achievements, and daily rewards to encourage competition and keep players motivated. Multiplayer options allow friends to challenge each other and share progress. Regular updates add new games and features, ensuring the experience never feels repetitive. With intuitive controls, colorful graphics, and smooth performance, this hub is ideal for both casual gamers and those looking to test their skills across different genres.",
    "size": 55.4,
    "reviews": 2100,
    "ratingAvg": 4.6,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1010 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTsHikVzMSrWjbB21clEvj5vyqajXATE92UCA&s",
    "title": "HomeSecure",
    "companyName": "SafeTech Solutions",
    "id": 8,
    "description": "This home security system monitoring and alerts app is designed to provide peace of mind by keeping your property safe and secure at all times. It connects seamlessly with smart cameras, motion detectors, and door or window sensors, allowing users to monitor their home in real time from anywhere. The app sends instant notifications and alerts whenever unusual activity is detected, ensuring quick response to potential threats. Users can access live video feeds, review recorded footage, and manage multiple security devices from a single dashboard. With customizable settings, you can adjust sensitivity levels, create automation rules, and choose alert preferences to fit your lifestyle. Advanced features such as night vision support, two-way audio, and remote arming or disarming give complete control over home security. The system also provides detailed activity logs and reports, helping homeowners stay informed about daily events. Whether at home, work, or traveling, this app ensures continuous protection, making it easier to safeguard your family, valuables, and property with reliable monitoring and real-time alerts.",
    "size": 15.2,
    "reviews": 700,
    "ratingAvg": 4.2,
    "downloads": 250000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 230 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxQPLpMvXeAlDjeFtF-OAiZ9IGRSdytMlCCQ0eNGPMwjsCeuAuGHYGf1L_sosQL1sVJrQ&usqp=CAU",
    "title": "Invoicer",
    "companyName": "BizTools",
    "id": 9,
    "description": "This invoice and billing management app is built specifically for small businesses to simplify financial operations and improve cash flow. It enables business owners to create and send professional invoices in just a few clicks, reducing paperwork and saving valuable time. Users can customize invoice templates with branding, track payment status in real time, and set automated reminders to ensure clients never miss a due date. The app also supports recurring billing, tax calculations, and multiple payment methods, making it convenient for both businesses and customers. Detailed reports and analytics provide insights into revenue, outstanding balances, and client payment patterns, helping owners make informed decisions. With secure data storage and easy access across mobile and web platforms, the app ensures that financial records remain organized and up to date. Whether you are a freelancer, retailer, or service provider, this tool helps manage invoices, reduce errors, and maintain healthy business finances effortlessly.",
    "size": 12.4,
    "reviews": 650,
    "ratingAvg": 4.0,
    "downloads": 220000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 120 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyHhg5j-hXmHB9CuEV7HrfesI0O8sXMJEP6w&s",
    "title": "JourneyMap",
    "companyName": "TravelWise",
    "id": 10,
    "description": "This travel planner and map navigation app is designed to make every journey smarter, easier, and more enjoyable. It combines advanced navigation with personalized trip planning tools, allowing users to organize itineraries, discover destinations, and get step-by-step guidance in one platform. Travelers can search for routes, landmarks, hotels, restaurants, and attractions, while saving favorite places for quick access later. The app provides accurate, real-time GPS navigation with turn-by-turn directions, offline map downloads, and traffic updates, ensuring safe and hassle-free travel even without internet access. Users can create day-by-day schedules, add notes, and share itineraries with friends or family members, making group travel coordination effortless. Smart suggestions highlight popular sights, hidden gems, and local experiences tailored to user interests, while integrated expense tracking helps manage budgets along the way. With support for multiple modes of transport such as driving, walking, cycling, and public transit, the app adapts to different travel styles. Security features like location sharing add peace of mind when exploring unfamiliar areas. Whether planning a short weekend trip or a long international adventure, this app acts as a complete travel companion, offering reliable navigation and detailed planning tools to make every journey stress-free and memorable.",
    "size": 30.0,
    "reviews": 1400,
    "ratingAvg": 4.5,
    "downloads": 550000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 710 }
    ]
  },
  {
    "image": "https://thumbs.dreamstime.com/b/bright-education-logo-26459220.jpg",
    "title": "KidsLearn",
    "companyName": "BrightFuture EdTech",
    "id": 11,
    "description": "This educational games app for children is designed to make learning fun, engaging, and interactive. It offers a wide variety of age-appropriate games that teach essential skills such as math, reading, spelling, problem-solving, and creativity. Each game is carefully developed with colorful graphics, playful animations, and simple controls that children can easily understand and enjoy. The app encourages curiosity and exploration while helping kids build confidence in their abilities through rewards, achievements, and progress tracking. Parents can monitor their child’s learning journey and adjust difficulty levels to match their age and needs. With offline play options, kids can learn and have fun anywhere, anytime. Safe, secure, and free of harmful content, this app creates a positive digital learning environment that supports both early education and ongoing skill development for young learners.",
    "size": 20.6,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": 450000,
    "ratings": [
      { "name": "1 star", "count": 12 },
      { "name": "2 star", "count": 38 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 450 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/T8VpmRoEZggWddkKJ5CClQBhn2NnnIYmz-vjis8_n1t2n5fQ5lXQej1Jj0N3ZnxtsOw",
    "title": "LifeJournal",
    "companyName": "Mindful Apps",
    "id": 12,
    "description": "This daily journaling and mood tracking app is designed to help users reflect, organize thoughts, and monitor emotional well-being over time. It provides a simple and intuitive interface where individuals can record daily experiences, jot down personal reflections, and capture important moments in text, images, or audio format. Alongside journaling, the app features mood tracking tools that allow users to log feelings, energy levels, and emotional patterns throughout the day. With interactive charts and detailed analytics, users can identify trends, triggers, and improvements in their mental health, offering valuable insights for self-awareness and personal growth. Customizable reminders encourage consistent journaling habits, while password protection and secure cloud storage ensure privacy and safety of personal entries. The app also includes prompts, inspirational quotes, and guided exercises to spark creativity and help users process complex emotions effectively. By combining journaling with mood tracking, the app supports mindfulness, stress reduction, and overall mental well-being. Whether used for personal reflection, mental health support, or habit building, this tool provides a comprehensive platform to nurture emotional intelligence and maintain a balanced, healthy lifestyle. It empowers users to take control of their emotional journey, track progress, and cultivate positive routines that promote long-term wellness and self-improvement.",
    "size": 16.8,
    "reviews": 900,
    "ratingAvg": 4.3,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 432 }
    ]
  },
  {
    "image": "https://stockpulse.ai/images/stockpulse_logo_square_graph_tag.webp",
    "title": "MarketWatch",
    "companyName": "StockPulse",
    "id": 13,
    "description": "This real-time stock market tracker app provides investors with up-to-date market information and alerts to make informed decisions. Users can monitor stock prices, indices, and trends instantly, while receiving notifications on price changes, market news, and portfolio performance. The app offers customizable watchlists, interactive charts, and detailed analytics to help track investments effectively. Whether you are a beginner or an experienced trader, this tool ensures you stay connected to the market at all times, enabling timely actions and smarter investment choices.",
    "size": 28.7,
    "reviews": 1800,
    "ratingAvg": 4.7,
    "downloads": 700000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1010 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRFUfHdHCcfNp5uKP1NqHzLaCkRmEN4e2GDfQ&s",
    "title": "NewsFlash",
    "companyName": "MediaNext",
    "id": 14,
    "description": "This news aggregator app delivers the latest news from multiple sources in a single, easy-to-use platform while allowing users to personalize content based on their interests. It covers a wide range of topics including technology, politics, sports, entertainment, business, and world events, ensuring that users never miss important updates. The app features customizable feeds, smart recommendations, and trending stories, helping users discover relevant content quickly. With real-time notifications, bookmarking, and offline reading options, users can stay informed anytime and anywhere. The clean interface and organized layout make browsing seamless, while sharing options allow users to discuss news with friends and social networks. By combining comprehensive coverage with personalization, this app provides an engaging and convenient news experience for readers seeking to stay updated efficiently.",
    "size": 19.5,
    "reviews": 1300,
    "ratingAvg": 4.2,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 365 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/UDnqTuwLRc4Dgu3c27Wt3LoVtW7UsYzpHTiRqDqLPUxz_FUnfc14TvkRoInsqePnrw",
    "title": "OrganizeIt",
    "companyName": "FlowSoft",
    "id": 15,
    "description": "This all-in-one organizer app combines notes, tasks, and calendar features into a single, streamlined platform, helping users manage their personal and professional lives efficiently. With intuitive note-taking tools, users can quickly capture ideas, jot down important information, and organize content with folders, tags, and rich formatting options. The task manager allows creation, prioritization, and tracking of to-do lists, deadlines, and recurring tasks, ensuring nothing is overlooked. Integrated calendar functionality provides a clear overview of schedules, appointments, and events, with reminders and notifications to keep users on track. The app supports syncing across devices, making it accessible anytime and anywhere, and offers collaboration features for sharing notes or tasks with colleagues, friends, or family members. By combining notes, tasks, and calendar in one platform, this app helps users stay organized, boost productivity, and efficiently balance work, study, and personal activities, making daily planning simple and effective.",
    "size": 21.2,
    "reviews": 1000,
    "ratingAvg": 4.5,
    "downloads": 420000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 445 }
    ]
  },
  {
    "image": "https://www.pixelworks.com/media/wp-content/uploads/2022/02/cover.png",
    "title": "PhotoMaster",
    "companyName": "PixelWorks",
    "id": 16,
    "description": "This photo editing and filter app allows users to enhance, retouch, and transform images with ease. It offers a variety of filters, effects, and editing tools including cropping, brightness, contrast, and color adjustments. Users can quickly create professional-looking photos for social media, personal projects, or creative expression. The intuitive interface makes editing simple and enjoyable for everyone.",
    "size": 50.1,
    "reviews": 1600,
    "ratingAvg": 4.6,
    "downloads": 650000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 800 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/aDmbKriyzyrztoZbD2lrfl2GjOjFokgeWvy0-Raxnsa9f4CGCRc34Y21-VrWanbkPpE",
    "title": "QuickScan",
    "companyName": "DocuTech",
    "id": 17,
    "description": "This document scanner and PDF converter app is designed to make digitizing paperwork simple, fast, and efficient. Users can quickly scan physical documents, receipts, invoices, or notes using their mobile device’s camera, producing high-quality digital copies. The app automatically detects edges, adjusts brightness, and enhances text clarity to ensure accurate and professional results. Once scanned, documents can be converted into PDF format for easy sharing, storage, or printing. Additional features include organizing files into folders, merging multiple scans into a single PDF, adding annotations, and applying password protection for sensitive documents. The app supports cloud integration, enabling seamless backup and access across devices. Ideal for students, professionals, and businesses, it streamlines document management, reduces paper clutter, and ensures important information is always accessible. With its intuitive interface and reliable performance, this tool transforms smartphones into powerful portable scanners and PDF converters, making document handling faster and more convenient than ever.",
    "size": 14.9,
    "reviews": 800,
    "ratingAvg": 4.3,
    "downloads": 280000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 320 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/21/60/76/21607669-f9db-a5cc-0f3d-de8156e39d24/AppIcon-0-0-1x_U007epad-0-1-85-220.png/1200x600wa.png",
    "title": "ReadMate",
    "companyName": "LitApps",
    "id": 18,
    "description": "This eBook reader and library manager app provides a seamless reading experience while keeping all your digital books organized in one place. Users can import eBooks in various formats, customize reading preferences such as font size, background color, and brightness, and enjoy features like bookmarks, highlights, and notes to enhance comprehension. The app includes a powerful library management system that categorizes books, tracks reading progress, and allows easy searching and sorting of titles. With offline reading support, users can enjoy their favorite books anywhere without internet access. Additional features like syncing across devices, personalized recommendations, and cloud backup make it simple to access your entire collection anytime. Ideal for students, book enthusiasts, and avid readers, this app combines a user-friendly interface with robust organizational tools to create a comprehensive eBook reading and management solution.",
    "size": 17.4,
    "reviews": 950,
    "ratingAvg": 4.4,
    "downloads": 350000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 390 }
    ]
  },
  {
    "image": "https://cdn.freebiesupply.com/logos/large/2x/retailtech-logo-png-transparent.png",
    "title": "ShopEasy",
    "companyName": "RetailTech",
    "id": 19,
    "description": "This online marketplace mobile app connects buyers and sellers in a convenient, user-friendly platform, making shopping and selling easier than ever. Users can browse a wide range of products across various categories, including electronics, fashion, home goods, and more. The app provides detailed product descriptions, high-quality images, and customer reviews to help users make informed purchasing decisions. Sellers can easily list items, manage inventory, and track orders, while buyers enjoy secure payment options and real-time notifications about order status. Advanced search and filter features allow users to quickly find what they need, while personalized recommendations enhance the shopping experience. With integrated messaging, buyers and sellers can communicate directly for inquiries and support. The app also offers deals, discounts, and promotions to make shopping more rewarding. Ideal for small businesses, entrepreneurs, and everyday shoppers, this marketplace app streamlines online commerce and brings a complete, seamless shopping experience to mobile devices.",
    "size": 35.8,
    "reviews": 2200,
    "ratingAvg": 4.5,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 880 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSmA-vW_kXLI75DbjNmo5Qmfh8Es8D2_0yCtg&s",
    "title": "TravelGuide",
    "companyName": "GlobeTrek",
    "id": 20,
    "description": "This travel app offers local guides, curated tours, and personalized travel itineraries to help users explore destinations efficiently and enjoyably. Users can discover popular attractions, hidden gems, restaurants, and cultural experiences with detailed information and recommendations. The app allows travelers to plan day-by-day schedules, customize routes, and access offline maps for convenient navigation. Interactive features include user reviews, ratings, and tips from locals, making trip planning more authentic and reliable. Whether planning a weekend getaway or an extended vacation, this app provides all the tools needed to create seamless and memorable travel experiences. It also supports sharing itineraries with friends and family, making group travel easier to coordinate.",
    "size": 25.3,
    "reviews": 1200,
    "ratingAvg": 4.6,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 480 }
    ]
  },
  {
    "image": "https://marketplace.canva.com/EAE08FE0SUM/2/0/1600w/canva-black-and-orange-minimalist-education-logo-GXeg8FJ3aFI.jpg",
    "title": "UniChat",
    "companyName": "EduComms",
    "id": 21,
    "description": "This campus chat and social networking app is designed specifically for students to connect, collaborate, and communicate within their educational community. Users can join class groups, clubs, or campus-wide forums to share information, ask questions, and stay updated on events and announcements. The app features instant messaging, group chats, and discussion boards, making it easy to interact with peers and professors. Students can share multimedia content, post updates, and organize study sessions or campus activities. Personalized notifications ensure users never miss important messages or deadlines. The platform also emphasizes safety and privacy, providing secure access limited to verified students. With a clean, intuitive interface, this app fosters engagement, collaboration, and social interaction, helping students build connections, stay informed, and make the most of campus life.",
    "size": 23.0,
    "reviews": 1000,
    "ratingAvg": 4.4,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 380 }
    ]
  },
  {
    "image": "https://logopond.com/logos/d202483716623a28faf129260346569a.png",
    "title": "VideoCast",
    "companyName": "MediaFlow",
    "id": 22,
    "description": "This video streaming and casting service app is designed to provide users with a seamless and immersive entertainment experience across devices. It offers a vast library of movies, TV shows, documentaries, and original content, allowing users to explore a wide variety of genres and categories from the comfort of their home or on the go. The app supports high-definition streaming with adaptive quality, ensuring smooth playback even on varying internet speeds. Users can create personalized watchlists, receive recommendations based on viewing history, and track favorite series or movies effortlessly. Integrated casting functionality enables seamless connection to smart TVs, streaming devices, or other compatible screens, allowing users to enjoy content on larger displays. Additional features include parental controls, subtitles, multi-language support, and offline downloads for watching content without an internet connection. With intuitive navigation, advanced search filters, and curated playlists, the app makes discovering new content easy and enjoyable. Whether you are binge-watching a favorite series, exploring new movies, or sharing entertainment with friends and family, this service delivers high-quality, accessible, and versatile streaming options that cater to all tastes and viewing preferences.",
    "size": 40.2,
    "reviews": 1700,
    "ratingAvg": 4.5,
    "downloads": 800000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 170 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 845 }
    ]
  },
  {
    "image": "https://assets.bizclikmedia.net/1200/24f375b42aa1835575764f19871285bb:24c50a5c2feb81c2afe72105ecc1afc6/cms-climate-tech-coming-soon-1.jpg",
    "title": "WeatherWise",
    "companyName": "ClimateTech",
    "id": 23,
    "description": "This real-time weather app provides accurate and up-to-date forecasts to help users plan their day and stay prepared for changing conditions. It offers hourly, daily, and weekly weather updates, including temperature, humidity, wind speed, precipitation, and UV index. Users receive instant alerts for severe weather events such as storms, heavy rain, or extreme temperatures, ensuring safety and timely precautions. The app includes interactive maps with radar and satellite imagery, allowing users to track weather patterns visually. Customizable notifications enable users to get personalized updates for their location or multiple saved locations. With a clean and intuitive interface, the app makes accessing detailed weather information quick and simple. Whether planning outdoor activities, commuting, or traveling, this app equips users with reliable weather insights, helping them make informed decisions and stay safe in any environment.",
    "size": 14.7,
    "reviews": 1100,
    "ratingAvg": 4.3,
    "downloads": 360000,
    "ratings": [
      { "name": "1 star", "count": 12 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 433 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTES03swKsqJ67ji4YPM_6fvLCXsrGkugGuag&s",
    "title": "XPressScan",
    "companyName": "QuickTech",
    "id": 24,
    "description": "This fast scanning and OCR app allows users to quickly digitize physical documents, receipts, and notes using their mobile devices. It uses advanced optical character recognition (OCR) technology to convert scanned images into editable and searchable text, saving time and effort. Users can enhance scans with automatic edge detection, brightness adjustments, and filters for clear, professional-quality results. The app supports converting documents into various formats such as PDF or Word, making it easy to store, share, or print. Additional features include organizing scanned files into folders, adding annotations, and secure cloud backup. Ideal for students, professionals, and businesses, this tool streamlines document management, reduces paper clutter, and ensures important information is always accessible and editable when needed.",
    "size": 13.8,
    "reviews": 900,
    "ratingAvg": 4.2,
    "downloads": 320000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 320 }
    ]
  },
  {
    "image": "https://png.pngtree.com/png-vector/20190328/ourmid/pngtree-vector-health-icon-png-image_872217.jpg",
    "title": "YogaFlow",
    "companyName": "WellBeing Apps",
    "id": 25,
    "description": "This wellness app combines yoga routines, guided meditation, and holistic health tracking to help users achieve physical, mental, and emotional well-being. It offers a variety of yoga sessions tailored for different skill levels, from beginners to advanced practitioners, focusing on flexibility, strength, and balance. Guided meditation exercises promote relaxation, mindfulness, and stress reduction, supporting mental clarity and emotional stability. The app includes tools to track daily wellness activities, monitor progress, set personal goals, and receive reminders to maintain a consistent practice. Users can customize routines based on time, intensity, or focus areas, and access instructional videos and audio guidance for proper technique. Integration with wearable devices allows monitoring of activity levels, heart rate, and overall fitness, providing valuable insights into personal health patterns. Whether used at home, in a studio, or on the go, this app empowers individuals to cultivate a healthier lifestyle, reduce stress, improve flexibility, and maintain a balanced mind-body connection over time. It is ideal for anyone seeking to improve well-being through structured yoga, meditation, and wellness tracking.",
    "size": 24.9,
    "reviews": 950,
    "ratingAvg": 4.4,
    "downloads": 340000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 22 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 420 }
    ]
  },
  {
    "image": "https://images.squarespace-cdn.com/content/v1/52eaead0e4b0fd67cc51a9d3/1691031236298-63F0W89G47IB8TK4WBXS/Relaxtech.jpeg",
    "title": "ZenSleep",
    "companyName": "RelaxTech",
    "id": 26,
    "description": "This sleep monitoring and relaxation app is designed to help users improve sleep quality, track patterns, and create a calming bedtime environment. It provides tools to monitor sleep duration, cycles, and disturbances, giving detailed insights into rest quality and trends over time. The app includes a variety of soothing sounds, white noise, and guided relaxation sessions to help users fall asleep faster and stay asleep longer. Personalized recommendations and sleep tips are offered based on recorded data to support healthier sleep habits. Users can set bedtime reminders, wake-up alarms, and track daily sleep goals, promoting consistency and better overall wellness. Integration with wearable devices enables more accurate tracking of heart rate and movement during sleep. With its intuitive interface and customizable settings, the app is suitable for individuals seeking to reduce stress, overcome insomnia, or improve nightly rest, ensuring a more refreshed and energetic start to the day.",
    "size": 11.5,
    "reviews": 700,
    "ratingAvg": 4.3,
    "downloads": 280000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 295 }
    ]
  }
]
